; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v13 ?v2)
             (pred_5 ?v4 ?v7)
             (pred_6 ?v13 ?v7)
             (pred_11 ?v10 ?v13 )
	     (pred_4 ?v13)
             (pred_2 ?v3)
             (pred_8 ?v4)
             (pred_9 ?v7)
             (pred_12 ?v13)
             (pred_1 ?v4)
             (pred_3 ?v13)
             (pred_7 ))



(:action op_2
:parameters (?v5 ?v12 ?v1 ?v9)
:precondition (and (pred_2 ?v5) (pred_2 ?v12) (pred_8 ?v1) (pred_9 ?v9)
          (pred_10 ?v5 ?v12) (pred_5 ?v1 ?v9)
                   (pred_6 ?v12 ?v9) (pred_4 ?v5) 
                   (pred_12 ?v12) (pred_1 ?v1))
:effect (and  (pred_3 ?v12) (not (pred_12 ?v12))))


(:action op_4
:parameters (?v5 ?v11)
:precondition (and (pred_2 ?v5) (pred_2 ?v11)
               (pred_4 ?v5) (pred_10 ?v5 ?v11) (pred_3 ?v11))
:effect (and (pred_4 ?v11) (not (pred_4 ?v5))))

(:action op_1
:parameters (?v5 ?v1)
:precondition (and (pred_2 ?v5) (pred_8 ?v1) 
                  (pred_4 ?v5) (pred_11 ?v1 ?v5) (pred_7 ))
:effect (and (pred_1 ?v1)
   (not (pred_11 ?v1 ?v5)) (not (pred_7 ))))


(:action op_5
:parameters (?v5 ?v6 ?v8)
:precondition (and (pred_2 ?v5) (pred_8 ?v6) (pred_8 ?v8)
                  (pred_4 ?v5) (pred_1 ?v8) (pred_11 ?v6 ?v5))
:effect (and (pred_1 ?v6) (pred_11 ?v8 ?v5)
        (not (pred_1 ?v8)) (not (pred_11 ?v6 ?v5))))

(:action op_3
:parameters (?v5 ?v1)
:precondition (and (pred_2 ?v5) (pred_8 ?v1) 
                  (pred_4 ?v5) (pred_1 ?v1))
:effect (and (pred_7 ) (pred_11 ?v1 ?v5) (not (pred_1 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_14 obj_15 obj_17 obj_22 obj_07 obj_16 obj_04 obj_11 obj_08 obj_19 obj_20 obj_03 obj_05 obj_13 obj_01
    obj_18 obj_02 obj_09
    obj_12 obj_21 obj_06
    )

    (:init
       (pred_7)

       (pred_2 obj_10)
       (pred_2 obj_14)
       (pred_2 obj_15)
       (pred_2 obj_17)
       (pred_2 obj_22)
       (pred_2 obj_07)
       (pred_2 obj_16)
       (pred_2 obj_04)
       (pred_2 obj_11)
       (pred_2 obj_08)
       (pred_2 obj_19)
       (pred_2 obj_20)
       (pred_2 obj_03)
       (pred_2 obj_05)
       (pred_2 obj_13)
       (pred_2 obj_01)
       (pred_9 obj_18)
       (pred_9 obj_02)
       (pred_9 obj_09)
       (pred_8 obj_12)
       (pred_8 obj_21)
       (pred_8 obj_06)

       (pred_10 obj_10 obj_22)
       (pred_10 obj_10 obj_14)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_14 obj_15)
       (pred_10 obj_14 obj_10)
       (pred_10 obj_15 obj_16)
       (pred_10 obj_15 obj_17)
       (pred_10 obj_15 obj_14)
       (pred_10 obj_17 obj_04)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_22 obj_11)
       (pred_10 obj_22 obj_07)
       (pred_10 obj_22 obj_10)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_07 obj_16)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_07 obj_22)
       (pred_10 obj_16 obj_19)
       (pred_10 obj_16 obj_04)
       (pred_10 obj_16 obj_15)
       (pred_10 obj_16 obj_07)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_04 obj_17)
       (pred_10 obj_04 obj_16)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_08)
       (pred_10 obj_11 obj_22)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_08 obj_11)
       (pred_10 obj_19 obj_13)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_20 obj_01)
       (pred_10 obj_20 obj_04)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_03 obj_05)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_05 obj_13)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_03)
       (pred_10 obj_13 obj_01)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_13 obj_05)
       (pred_10 obj_01 obj_20)
       (pred_10 obj_01 obj_13)
       (pred_12 obj_08)
       (pred_12 obj_19)
       (pred_12 obj_16)
       (pred_6  obj_08 obj_18)
       (pred_6  obj_19 obj_02)
       (pred_6  obj_16 obj_09)
       (pred_3 obj_10)
       (pred_3 obj_14)
       (pred_3 obj_15)
       (pred_3 obj_17)
       (pred_3 obj_22)
       (pred_3 obj_07)
       (pred_3 obj_04)
       (pred_3 obj_11)
       (pred_3 obj_20)
       (pred_3 obj_03)
       (pred_3 obj_05)
       (pred_3 obj_13)
       (pred_3 obj_01)

       (pred_5  obj_12 obj_18)
       (pred_5  obj_21 obj_02)
       (pred_5  obj_06 obj_09)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_21 obj_04)
       (pred_11 obj_06 obj_01)
       (pred_4 obj_22)
    )

    (:goal (and
       (pred_11 obj_12 obj_22)
    ))
(:constraints
  (always (not (pred_4 obj_15)))
)
)

; plan
1. (op_4 obj_22 obj_11)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_03)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_03)
   goals met: 0 of 1
3. (op_4 obj_03 obj_05)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_05)
   goals met: 0 of 1
4. (op_4 obj_05 obj_13)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_13)
   goals met: 0 of 1
5. (op_4 obj_13 obj_01)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_01)
   goals met: 0 of 1
6. (op_4 obj_01 obj_20)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_20)
   goals met: 0 of 1
7. (op_4 obj_20 obj_04)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_04)
   goals met: 0 of 1
8. (op_1 obj_04 obj_12)
   deleted: (pred_11 obj_12 obj_04) (pred_7)
   added: (pred_1 obj_12)
   goals met: 0 of 1
9. (op_4 obj_04 obj_20)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_20)
   goals met: 0 of 1
10. (op_4 obj_20 obj_01)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_01)
   goals met: 0 of 1
11. (op_4 obj_01 obj_13)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_13)
   goals met: 0 of 1
12. (op_4 obj_13 obj_05)
   deleted: (pred_4 obj_13)
   added: (pred_4 obj_05)
   goals met: 0 of 1
13. (op_4 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_03)
   goals met: 0 of 1
14. (op_4 obj_03 obj_11)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_11)
   goals met: 0 of 1
15. (op_4 obj_11 obj_22)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_22)
   goals met: 0 of 1
16. (op_3 obj_22 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_7) (pred_11 obj_12 obj_22)
   goals met: 1 of 1
